Documents/ГАЛ_МаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ГАЛ_МаршрутныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГАЛ_Маршруты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГАЛ_СтатусыМаршрутногоЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтборС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтборПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказыНаДоставку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаДоставку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ГАЛ_ЗаказНаДоставку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГАЛ_МаршрутныйЛист/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
	

Процедура ПечатьМаршрутныйЛист(ТабДок, Ссылка) Экспорт
	
	МассивОбъектов = Ссылка;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент = ТабДок;

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаршрутныйЛист";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ГАЛ_МаршрутныйЛист.ПФ_MXL_МаршрутныйЛист");
	
	ОбластьЗаголовокДокумента		= Макет.ПолучитьОбласть("ЗаголовокДокумента");
	ОбластьШапкаДокумента 			= Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьШапкаТаблицы				= Макет.ПолучитьОбласть("ШапкаТаблицыБезМест");
	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
	ОбластьСтрокаТаблицы			= Макет.ПолучитьОбласть("СтрокаТаблицыБезМест");
	ОбластьИтоги 					= Макет.ПолучитьОбласть("ИтогиБезМест");
	ОбластьПодвалТаблицы 			= Макет.ПолучитьОбласть("ПодвалТаблицыБезМест");
	Для Каждого ТекДокумент из МассивОбъектов Цикл
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер", ТекДокумент.Номер);
	РеквизитыДокумента.Вставить("Дата",  ТекДокумент.Дата);
	
	ЗаголовокДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, НСтр("ru='Маршрутный лист'"));
	ОбластьЗаголовокДокумента.Параметры.ЗаголовокДокумента = ЗаголовокДокумента;
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
	ТабличныйДокумент,
	Макет,
	ОбластьЗаголовокДокумента,
	ТекДокумент.Ссылка);
	
	
	//ОбластьШапкаДокумента.Параметры.Заполнить(РезультатШапкаДокументов);
	ОбластьШапкаДокумента.Параметры.ТранспортноеСредство =  ТекДокумент.ТранспортноеСредство;
	ОбластьШапкаДокумента.Параметры.Водитель =  ТекДокумент.Водитель;
	ОбластьШапкаДокумента.Параметры.КурьерЭкспедитор =  ТекДокумент.КурьерЭкспедитор;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
	
	
	
	ИмяСтолбцаВес = НСтр("ru = 'Вес, %ЕдиницаИзмеренияВес%'");
			ИмяСтолбцаОбъем = НСтр("ru = 'Объем, %ЕдиницаИзмеренияОбъем%'");
			ИмяСтолбцаВес = СтрЗаменить(ИмяСтолбцаВес, "%ЕдиницаИзмеренияВес%", Константы.ЕдиницаИзмеренияВеса.Получить());
			ИмяСтолбцаОбъем = СтрЗаменить(ИмяСтолбцаОбъем, "%ЕдиницаИзмеренияОбъем%", Константы.ЕдиницаИзмеренияОбъема.Получить());
			
			ОбластьШапкаТаблицы.Параметры.ВесШапка = ИмяСтолбцаВес;
			ОбластьШапкаТаблицы.Параметры.ОбъемШапка = ИмяСтолбцаОбъем;

	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтроки = 0;
	ИтогоВес = 0;
	ИтогоОбъем = 0;
	
	ТЗСуммыДокументов = Новый ТаблицаЗначений;
	ТЗСуммыДокументов.Колонки.Добавить("Валюта",,"Валюта");
	ТЗСуммыДокументов.Колонки.Добавить("Сумма",,"Сумма");
	
	Для Каждого ТекМаршрут из  ТекДокумент.ЗаказыНаДоставку Цикл
		
		НомерСтроки = НомерСтроки + 1;
				
		ЗаказНаДоставку = ТекМаршрут.ЗаказНаДоставку; 
		
		ТекСуммаДокумента = ЗаказНаДоставку.СуммаДокумента;
		ТекВалюта         = ЗаказНаДоставку.Валюта;

		
		ОбластьСтрокаТаблицы.Параметры.НомерЗаказа    = НомерСтроки;           
		ОбластьСтрокаТаблицы.Параметры.Адрес          = ЗаказНаДоставку.АдресДоставки;
		ОбластьСтрокаТаблицы.Параметры.ВремяС         = "с   " + Строка(Формат(ЗаказНаДоставку.ВремяДоставкиС,"ДФ=ЧЧ-мм"))  + " по " +Строка(Формат(ЗаказНаДоставку.ВремяДоставкиПо,"ДФ=Ч-мм")) ;
		ОбластьСтрокаТаблицы.Параметры.ДополнительнаяИнформация   = ЗаказНаДоставку.ДополнительнаяИнформацияПоДоставке;
		ОбластьСтрокаТаблицы.Параметры.Получатель     = ЗаказНаДоставку.Контрагент; 
		ОбластьСтрокаТаблицы.Параметры.Распоряжения   = ЗаказНаДоставку.ДокументОснование;

		Телефон1 = ?(СтрДлина(ЗаказНаДоставку.НомерТелефона)>5,ЗаказНаДоставку.НомерТелефона,"");
		Телефон2 = ?(СтрДлина(ЗаказНаДоставку.НомерТелефона2)>5,ЗаказНаДоставку.НомерТелефона2,"");
		
		ОбластьСтрокаТаблицы.Параметры.Телефон  = Строка(Телефон1) + Символы.ПС + Строка(Телефон2);
		
		Если ЗаказНаДоставку.ЗабратьДеньги Тогда
			ОбластьСтрокаТаблицы.Параметры.Сумма  = Формат(ТекСуммаДокумента,"ЧДЦ=1; ЧГ=") + " " + ТекВалюта;
			
			//Добавляем в таблицу сумм
			Отбор = Новый Структура();
			Отбор.Вставить("Валюта",ТекВалюта);
			НайденныеСтроки = ТЗСуммыДокументов.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество()>0  Тогда
				НайденныеСтроки[0].Сумма = НайденныеСтроки[0].Сумма + ТекСуммаДокумента;	
			Иначе
				НоваяСтрока = ТЗСуммыДокументов.Добавить();
				НоваяСтрока.Сумма = ТекСуммаДокумента;
				НоваяСтрока.Валюта = ТекВалюта;
			КонецЕсли;
		Иначе
			ОбластьСтрокаТаблицы.Параметры.Сумма  = "";
			
		КонецЕсли;
	
		
		
		Вес   = 0;
		Объем = 0;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Отменено",Ложь);
		
		ТемпТовары = ЗаказНаДоставку.Товары.Выгрузить(Отбор,);
		//Вес и Объем в единицах измерения
		Вес   = ТемпТовары.Итог("Вес"); //* ДоставкаТоваров.КоэффициентПересчетаВТонны();
		Объем = ТемпТовары.Итог("Объем");
		
		ОбластьСтрокаТаблицы.Параметры.Вес     = Вес;
		ОбластьСтрокаТаблицы.Параметры.Объем   = Объем;
		
		ИтогоВес = ИтогоВес + Вес;
		ИтогоОбъем = ИтогоОбъем + Объем;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла; 
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	
	ОбластьИтоги.Параметры.ИтогоВес = ИтогоВес;
	ОбластьИтоги.Параметры.ИтогоОбъем = ИтогоОбъем;
	КоличествоВалют = ТЗСуммыДокументов.Количество();
	Если КоличествоВалют > 0 Тогда
		 ОбластьИтоги.Параметры.ИтогоСумма = Формат(ТЗСуммыДокументов[0].Сумма,"ЧДЦ=1; ЧГ=") + " " + ТЗСуммыДокументов[0].Валюта;
	КонецЕсли; 
	
	ОбластьИтоги.Параметры.Итого = "Итого:";
	ТабличныйДокумент.Вывести(ОбластьИтоги);
	
	
	Если КоличествоВалют > 1 Тогда
		Для Счетчик=1 По КоличествоВалют-1 Цикл
			ОбластьИтоги.Параметры.Итого = "";
			ОбластьИтоги.Параметры.ИтогоВес = "";
			ОбластьИтоги.Параметры.ИтогоОбъем = "";
			ОбластьИтоги.Параметры.ИтогоСумма = Формат(ТЗСуммыДокументов[Счетчик].Сумма,"ЧДЦ=1; ЧГ=") + " " + ТЗСуммыДокументов[Счетчик].Валюта;
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			
		КонецЦикла;
	КонецЕсли;
	
КонецЦикла;



    ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	
	
	

	
	//Возврат ТабличныйДокумент;
	
  
	
	
	
	//}}
КонецПроцедуры
	
	
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	  // Маршрутный лист
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МаршрутныйЛист";
	КомандаПечати.Представление = НСтр("ru = 'Маршрутный лист'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	

КонецПроцедуры


Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МаршрутныйЛист") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"МаршрутныйЛист",
				НСтр("ru = 'Маршрутный лист'"),
				СформироватьПечатнуюФормуМаршрутныйЛист(
					МассивОбъектов,
					ОбъектыПечати));
		
	КонецЕсли;
	
		
КонецПроцедуры


Функция СформироватьПечатнуюФормуМаршрутныйЛист(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаршрутныйЛист";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ГАЛ_МаршрутныйЛист.ПФ_MXL_МаршрутныйЛист");
	
	ОбластьЗаголовокДокумента		= Макет.ПолучитьОбласть("ЗаголовокДокумента");
	ОбластьШапкаДокумента 			= Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьШапкаТаблицы				= Макет.ПолучитьОбласть("ШапкаТаблицыБезМест");
	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
	ОбластьСтрокаТаблицы			= Макет.ПолучитьОбласть("СтрокаТаблицыБезМест");
	ОбластьИтоги 					= Макет.ПолучитьОбласть("ИтогиБезМест");
	ОбластьПодвалТаблицы 			= Макет.ПолучитьОбласть("ПодвалТаблицыБезМест");
	Для Каждого ТекДокумент из МассивОбъектов Цикл
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Номер", ТекДокумент.Номер);
	РеквизитыДокумента.Вставить("Дата",  ТекДокумент.Дата);
	
	ЗаголовокДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, НСтр("ru='Маршрутный лист'"));
	ОбластьЗаголовокДокумента.Параметры.ЗаголовокДокумента = ЗаголовокДокумента;
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
	ТабличныйДокумент,
	Макет,
	ОбластьЗаголовокДокумента,
	ТекДокумент.Ссылка);
	
	
	//ОбластьШапкаДокумента.Параметры.Заполнить(РезультатШапкаДокументов);
	ОбластьШапкаДокумента.Параметры.ТранспортноеСредство =  ТекДокумент.ТранспортноеСредство;
	ОбластьШапкаДокумента.Параметры.Водитель =  ТекДокумент.Водитель;
	ОбластьШапкаДокумента.Параметры.КурьерЭкспедитор =  ТекДокумент.КурьерЭкспедитор;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
	
	
	
	ИмяСтолбцаВес = НСтр("ru = 'Вес, %ЕдиницаИзмеренияВес%'");
			ИмяСтолбцаОбъем = НСтр("ru = 'Объем, %ЕдиницаИзмеренияОбъем%'");
			ИмяСтолбцаВес = СтрЗаменить(ИмяСтолбцаВес, "%ЕдиницаИзмеренияВес%", Константы.ЕдиницаИзмеренияВеса.Получить());
			ИмяСтолбцаОбъем = СтрЗаменить(ИмяСтолбцаОбъем, "%ЕдиницаИзмеренияОбъем%", Константы.ЕдиницаИзмеренияОбъема.Получить());
			
			ОбластьШапкаТаблицы.Параметры.ВесШапка = ИмяСтолбцаВес;
			ОбластьШапкаТаблицы.Параметры.ОбъемШапка = ИмяСтолбцаОбъем;

	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтроки = 0;
	ИтогоВес = 0;
	ИтогоОбъем = 0;
	
	ТЗСуммыДокументов = Новый ТаблицаЗначений;
	ТЗСуммыДокументов.Колонки.Добавить("Валюта",,"Валюта");
	ТЗСуммыДокументов.Колонки.Добавить("Сумма",,"Сумма");
	
	Для Каждого ТекМаршрут из  ТекДокумент.ЗаказыНаДоставку Цикл
		
		НомерСтроки = НомерСтроки + 1;
				
		ЗаказНаДоставку = ТекМаршрут.ЗаказНаДоставку; 
		
		ТекСуммаДокумента = ЗаказНаДоставку.СуммаДокумента;
		ТекВалюта         = ЗаказНаДоставку.Валюта;

		
		ОбластьСтрокаТаблицы.Параметры.НомерЗаказа    = НомерСтроки;           
		ОбластьСтрокаТаблицы.Параметры.Адрес          = ЗаказНаДоставку.АдресДоставки;
		ОбластьСтрокаТаблицы.Параметры.ВремяС         = "с   " + Строка(Формат(ЗаказНаДоставку.ВремяДоставкиС,"ДФ=ЧЧ-мм"))  + " по " +Строка(Формат(ЗаказНаДоставку.ВремяДоставкиПо,"ДФ=Ч-мм")) ;
		ОбластьСтрокаТаблицы.Параметры.ДополнительнаяИнформация   = ЗаказНаДоставку.ДополнительнаяИнформацияПоДоставке;
		ОбластьСтрокаТаблицы.Параметры.Получатель     = ЗаказНаДоставку.Контрагент; 
		ОбластьСтрокаТаблицы.Параметры.Распоряжения   = ЗаказНаДоставку.ДокументОснование;

		Телефон1 = ?(СтрДлина(ЗаказНаДоставку.НомерТелефона)>5,ЗаказНаДоставку.НомерТелефона,"");
		Телефон2 = ?(СтрДлина(ЗаказНаДоставку.НомерТелефона2)>5,ЗаказНаДоставку.НомерТелефона2,"");
		
		ОбластьСтрокаТаблицы.Параметры.Телефон  = Строка(Телефон1) + Символы.ПС + Строка(Телефон2);
		
		Если ЗаказНаДоставку.ЗабратьДеньги Тогда
			ОбластьСтрокаТаблицы.Параметры.Сумма  = Формат(ТекСуммаДокумента,"ЧДЦ=1; ЧГ=") + " " + ТекВалюта;
			
			//Добавляем в таблицу сумм
			Отбор = Новый Структура();
			Отбор.Вставить("Валюта",ТекВалюта);
			НайденныеСтроки = ТЗСуммыДокументов.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество()>0  Тогда
				НайденныеСтроки[0].Сумма = НайденныеСтроки[0].Сумма + ТекСуммаДокумента;	
			Иначе
				НоваяСтрока = ТЗСуммыДокументов.Добавить();
				НоваяСтрока.Сумма = ТекСуммаДокумента;
				НоваяСтрока.Валюта = ТекВалюта;
			КонецЕсли;
		Иначе
			ОбластьСтрокаТаблицы.Параметры.Сумма  = "";
			
		КонецЕсли;
	
		
		
		Вес   = 0;
		Объем = 0;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Отменено",Ложь);
		
		ТемпТовары = ЗаказНаДоставку.Товары.Выгрузить(Отбор,);
		//Вес и Объем в единицах измерения
		Вес   = ТемпТовары.Итог("Вес"); //* ДоставкаТоваров.КоэффициентПересчетаВТонны();
		Объем = ТемпТовары.Итог("Объем");
		
		ОбластьСтрокаТаблицы.Параметры.Вес     = Вес;
		ОбластьСтрокаТаблицы.Параметры.Объем   = Объем;
		
		ИтогоВес = ИтогоВес + Вес;
		ИтогоОбъем = ИтогоОбъем + Объем;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла; 
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	
	ОбластьИтоги.Параметры.ИтогоВес = ИтогоВес;
	ОбластьИтоги.Параметры.ИтогоОбъем = ИтогоОбъем;
	КоличествоВалют = ТЗСуммыДокументов.Количество();
	Если КоличествоВалют > 0 Тогда
		 ОбластьИтоги.Параметры.ИтогоСумма = Формат(ТЗСуммыДокументов[0].Сумма,"ЧДЦ=1; ЧГ=") + " " + ТЗСуммыДокументов[0].Валюта;
	КонецЕсли; 
	
	ОбластьИтоги.Параметры.Итого = "Итого:";
	ТабличныйДокумент.Вывести(ОбластьИтоги);
	
	
	Если КоличествоВалют > 1 Тогда
		Для Счетчик=1 По КоличествоВалют-1 Цикл
			ОбластьИтоги.Параметры.Итого = "";
			ОбластьИтоги.Параметры.ИтогоВес = "";
			ОбластьИтоги.Параметры.ИтогоОбъем = "";
			ОбластьИтоги.Параметры.ИтогоСумма = Формат(ТЗСуммыДокументов[Счетчик].Сумма,"ЧДЦ=1; ЧГ=") + " " + ТЗСуммыДокументов[Счетчик].Валюта;
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			
		КонецЦикла;
	КонецЕсли;
	
КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции


Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
    
ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
    
КонецПроцедуры


#КонецЕсли
